print('Карточка студента:')
surname=input('Введите фамилию:')
name=input('Введите имя:')
group=input('Введите группу:')
city=input('Введите город:')
age=input('Введите возраст в полных годах(целое от 1 до 120):')
favorite_subject=input('Введите любимый предмет:')
hours=float(input('Введите количество часов подготовки в неделю(неотрицательное дробное число):'))
h=int(hours)/7
print('Карточка студента:')
print('полное имя:',name,surname)
print('возраст спустя 4 года:',int(age)+4)
print('время подготовки за 4 недели и среднее время в день за семидневную неделю:',int(age)*4,'и',f'{h:.2f}')




