first_subject=input("Введите название первого предмета: ")
second_subject=input("Введите название второго предмета: ")
colvo1=int(input("Введите количество занятий по первому предмету за неделю: "))
colvo2=int(input("Введите количество занятий по второму предмету за неделю: "))
prod1=int(input("Введите продолжительность одного занятия по первому предмету в минутах: "))
prod2=int(input("Введите продолжительность одного занятия по второму предмету в минутах: "))
available_time=float(input("Доступное время на неделю в часах: ").replace(",", "."))
a1=colvo1*prod1          
a2=colvo2*prod2          
b1=a1+a2           
b2=b1/60        
c1=available_time-b2
c2=b2*4 
print(first_subject, ':', a1, 'минут')
print(second_subject, ':', a2, 'минут')
print('общая нагрузка за неделю:', b1, 'минут')
print('общая нагрузка за неделю:', f'{b2:.2f}', 'часов')
print('остаток свободного времени за неделю:', f'{c1:.2f}', 'часа/часов')
print('нагрузка за 4 недели:', f'{c2:.2f}', 'часа/часов')
